# TaperedWallAnglesControlledByType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..TaperedWallAnglesControlledByType Property
BuiltInFailures..::..WallFailures Class See Also
---
Cannot set angles on a tapered wall which has angles controlled by the type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TaperedWallAnglesControlledByType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TaperedWallAnglesControlledByType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TaperedWallAnglesControlledByType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace